3-Sinter_vs_Microchannel_Comparison/1uW_load_envelope/Ag_1p0_s12p5/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| Stage 4 MXC Heat Exchanger — S4_MC_Cu_1p0  (v2: real multi-channel)        |
| 5-channel microchannel array, OFHC Cu, Dh = 1.0 mm                         |
| Adapted from Buoyancy_50K_Microchannel topology (5 parallel channels)       |
| Spec: Stage4_HX_OpenFOAM_Specification.docx §2.1                           |
\*---------------------------------------------------------------------------*/
//
// Cross-section (y-z plane, x = flow direction):
//
//  z=2.0mm |============================== hotPlate (100 mK) =========================|
//           | sw |  ch1  | w |  ch2  | w |  ch3  | w |  ch4  | w |  ch5  | sw |
//  z=0.5mm  |-------------------------------------------------------------------------|
//           |================== chipFace (10 mK) ===================================|
//  z=0
//
//  y [mm]:  0  0.5  1.5  2.0  3.0  3.5  4.5  5.0  6.0  6.5  7.5  8.0
//  iy:      0   1    2    3    4    5    6    7    8    9   10   11
//
// Geometry:
//   Channel (fluid_he): Dh = 1.0 mm square, 5 channels in y
//   Wall thickness:     0.5 mm (inter-channel and outer walls)
//   Block height (z):   2.0 mm (0.5 bottom solid + 1.0 channels + 0.5 top solid)
//   Block width  (y):   8.0 mm
//   Length (x):         100 mm
//
// Vertex index: idx = ix*48 + iz*12 + iy
//   ix=0 (x=0), ix=1 (x=0.1);  iz=0..3;  iy=0..11
//
// Blocks (33 total, 3 z-strips x 11 y-strips):
//   fluid_he:   iz=1, iy in {1,3,5,7,9}  -> 5 channel blocks (120,000 cells)
//   solid_wall: remaining 28 blocks        -> 88,320 cells
//   Total: 208,320 cells
//
// Directions: i=+y (v0->v1, first count), j=+z (v0->v3, second), k=+x (v0->v4, third)
// Cell counts: (ny  nz  60)

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    // ---- x=0 face (ix=0, idx = iz*12 + iy) ----
    //  iz=0  z=0  (chip face)
    (0    0        0      )  //  0  iy=0  outer left
    (0    5e-4     0      )  //  1  iy=1  ch1 left
    (0    1.5e-3   0      )  //  2  iy=2  ch1 right
    (0    2e-3     0      )  //  3  iy=3  ch2 left
    (0    3e-3     0      )  //  4  iy=4  ch2 right
    (0    3.5e-3   0      )  //  5  iy=5  ch3 left
    (0    4.5e-3   0      )  //  6  iy=6  ch3 right
    (0    5e-3     0      )  //  7  iy=7  ch4 left
    (0    6e-3     0      )  //  8  iy=8  ch4 right
    (0    6.5e-3   0      )  //  9  iy=9  ch5 left
    (0    7.5e-3   0      )  // 10  iy=10 ch5 right
    (0    8e-3     0      )  // 11  iy=11 outer right
    //  iz=1  z=5e-4  (bottom of channels)
    (0    0        5e-4   )  // 12
    (0    5e-4     5e-4   )  // 13
    (0    1.5e-3   5e-4   )  // 14
    (0    2e-3     5e-4   )  // 15
    (0    3e-3     5e-4   )  // 16
    (0    3.5e-3   5e-4   )  // 17
    (0    4.5e-3   5e-4   )  // 18
    (0    5e-3     5e-4   )  // 19
    (0    6e-3     5e-4   )  // 20
    (0    6.5e-3   5e-4   )  // 21
    (0    7.5e-3   5e-4   )  // 22
    (0    8e-3     5e-4   )  // 23
    //  iz=2  z=1.5e-3  (top of channels)
    (0    0        1.5e-3 )  // 24
    (0    5e-4     1.5e-3 )  // 25
    (0    1.5e-3   1.5e-3 )  // 26
    (0    2e-3     1.5e-3 )  // 27
    (0    3e-3     1.5e-3 )  // 28
    (0    3.5e-3   1.5e-3 )  // 29
    (0    4.5e-3   1.5e-3 )  // 30
    (0    5e-3     1.5e-3 )  // 31
    (0    6e-3     1.5e-3 )  // 32
    (0    6.5e-3   1.5e-3 )  // 33
    (0    7.5e-3   1.5e-3 )  // 34
    (0    8e-3     1.5e-3 )  // 35
    //  iz=3  z=2e-3  (hot plate face)
    (0    0        2e-3   )  // 36
    (0    5e-4     2e-3   )  // 37
    (0    1.5e-3   2e-3   )  // 38
    (0    2e-3     2e-3   )  // 39
    (0    3e-3     2e-3   )  // 40
    (0    3.5e-3   2e-3   )  // 41
    (0    4.5e-3   2e-3   )  // 42
    (0    5e-3     2e-3   )  // 43
    (0    6e-3     2e-3   )  // 44
    (0    6.5e-3   2e-3   )  // 45
    (0    7.5e-3   2e-3   )  // 46
    (0    8e-3     2e-3   )  // 47

    // ---- x=0.1 face (ix=1, idx = 48 + iz*12 + iy) ----
    //  iz=0  z=0
    (0.1  0        0      )  // 48
    (0.1  5e-4     0      )  // 49
    (0.1  1.5e-3   0      )  // 50
    (0.1  2e-3     0      )  // 51
    (0.1  3e-3     0      )  // 52
    (0.1  3.5e-3   0      )  // 53
    (0.1  4.5e-3   0      )  // 54
    (0.1  5e-3     0      )  // 55
    (0.1  6e-3     0      )  // 56
    (0.1  6.5e-3   0      )  // 57
    (0.1  7.5e-3   0      )  // 58
    (0.1  8e-3     0      )  // 59
    //  iz=1  z=5e-4
    (0.1  0        5e-4   )  // 60
    (0.1  5e-4     5e-4   )  // 61
    (0.1  1.5e-3   5e-4   )  // 62
    (0.1  2e-3     5e-4   )  // 63
    (0.1  3e-3     5e-4   )  // 64
    (0.1  3.5e-3   5e-4   )  // 65
    (0.1  4.5e-3   5e-4   )  // 66
    (0.1  5e-3     5e-4   )  // 67
    (0.1  6e-3     5e-4   )  // 68
    (0.1  6.5e-3   5e-4   )  // 69
    (0.1  7.5e-3   5e-4   )  // 70
    (0.1  8e-3     5e-4   )  // 71
    //  iz=2  z=1.5e-3
    (0.1  0        1.5e-3 )  // 72
    (0.1  5e-4     1.5e-3 )  // 73
    (0.1  1.5e-3   1.5e-3 )  // 74
    (0.1  2e-3     1.5e-3 )  // 75
    (0.1  3e-3     1.5e-3 )  // 76
    (0.1  3.5e-3   1.5e-3 )  // 77
    (0.1  4.5e-3   1.5e-3 )  // 78
    (0.1  5e-3     1.5e-3 )  // 79
    (0.1  6e-3     1.5e-3 )  // 80
    (0.1  6.5e-3   1.5e-3 )  // 81
    (0.1  7.5e-3   1.5e-3 )  // 82
    (0.1  8e-3     1.5e-3 )  // 83
    //  iz=3  z=2e-3
    (0.1  0        2e-3   )  // 84
    (0.1  5e-4     2e-3   )  // 85
    (0.1  1.5e-3   2e-3   )  // 86
    (0.1  2e-3     2e-3   )  // 87
    (0.1  3e-3     2e-3   )  // 88
    (0.1  3.5e-3   2e-3   )  // 89
    (0.1  4.5e-3   2e-3   )  // 90
    (0.1  5e-3     2e-3   )  // 91
    (0.1  6e-3     2e-3   )  // 92
    (0.1  6.5e-3   2e-3   )  // 93
    (0.1  7.5e-3   2e-3   )  // 94
    (0.1  8e-3     2e-3   )  // 95
);

blocks
(
    // ===== iz=0  z=[0, 0.5mm]  bottom solid (chip-side)  nz=4 =====
    hex ( 0  1 13 12  48  49  61  60) solid_wall ( 4  4 60) simpleGrading (1 1 1) // outer-L
    hex ( 1  2 14 13  49  50  62  61) solid_wall (20  4 60) simpleGrading (1 1 1) // under ch1
    hex ( 2  3 15 14  50  51  63  62) solid_wall ( 4  4 60) simpleGrading (1 1 1) // wall pillar
    hex ( 3  4 16 15  51  52  64  63) solid_wall (20  4 60) simpleGrading (1 1 1) // under ch2
    hex ( 4  5 17 16  52  53  65  64) solid_wall ( 4  4 60) simpleGrading (1 1 1) // wall pillar
    hex ( 5  6 18 17  53  54  66  65) solid_wall (20  4 60) simpleGrading (1 1 1) // under ch3
    hex ( 6  7 19 18  54  55  67  66) solid_wall ( 4  4 60) simpleGrading (1 1 1) // wall pillar
    hex ( 7  8 20 19  55  56  68  67) solid_wall (20  4 60) simpleGrading (1 1 1) // under ch4
    hex ( 8  9 21 20  56  57  69  68) solid_wall ( 4  4 60) simpleGrading (1 1 1) // wall pillar
    hex ( 9 10 22 21  57  58  70  69) solid_wall (20  4 60) simpleGrading (1 1 1) // under ch5
    hex (10 11 23 22  58  59  71  70) solid_wall ( 4  4 60) simpleGrading (1 1 1) // outer-R

    // ===== iz=1  z=[0.5mm, 1.5mm]  channel layer  nz=20 =====
    hex (12 13 25 24  60  61  73  72) solid_wall ( 4 20 60) simpleGrading (1 1 1) // left outer wall
    hex (13 14 26 25  61  62  74  73) domain1   (20 20 60) simpleGrading (1 1 1) // CHANNEL 1
    hex (14 15 27 26  62  63  75  74) solid_wall ( 4 20 60) simpleGrading (1 1 1) // inter-ch wall
    hex (15 16 28 27  63  64  76  75) domain2   (20 20 60) simpleGrading (1 1 1) // CHANNEL 2
    hex (16 17 29 28  64  65  77  76) solid_wall ( 4 20 60) simpleGrading (1 1 1) // inter-ch wall
    hex (17 18 30 29  65  66  78  77) domain3   (20 20 60) simpleGrading (1 1 1) // CHANNEL 3
    hex (18 19 31 30  66  67  79  78) solid_wall ( 4 20 60) simpleGrading (1 1 1) // inter-ch wall
    hex (19 20 32 31  67  68  80  79) domain4   (20 20 60) simpleGrading (1 1 1) // CHANNEL 4
    hex (20 21 33 32  68  69  81  80) solid_wall ( 4 20 60) simpleGrading (1 1 1) // inter-ch wall
    hex (21 22 34 33  69  70  82  81) domain5   (20 20 60) simpleGrading (1 1 1) // CHANNEL 5
    hex (22 23 35 34  70  71  83  82) solid_wall ( 4 20 60) simpleGrading (1 1 1) // right outer wall

    // ===== iz=2  z=[1.5mm, 2.0mm]  top solid (hot-plate-side)  nz=4 =====
    hex (24 25 37 36  72  73  85  84) solid_wall ( 4  4 60) simpleGrading (1 1 1)
    hex (25 26 38 37  73  74  86  85) solid_wall (20  4 60) simpleGrading (1 1 1)
    hex (26 27 39 38  74  75  87  86) solid_wall ( 4  4 60) simpleGrading (1 1 1)
    hex (27 28 40 39  75  76  88  87) solid_wall (20  4 60) simpleGrading (1 1 1)
    hex (28 29 41 40  76  77  89  88) solid_wall ( 4  4 60) simpleGrading (1 1 1)
    hex (29 30 42 41  77  78  90  89) solid_wall (20  4 60) simpleGrading (1 1 1)
    hex (30 31 43 42  78  79  91  90) solid_wall ( 4  4 60) simpleGrading (1 1 1)
    hex (31 32 44 43  79  80  92  91) solid_wall (20  4 60) simpleGrading (1 1 1)
    hex (32 33 45 44  80  81  93  92) solid_wall ( 4  4 60) simpleGrading (1 1 1)
    hex (33 34 46 45  81  82  94  93) solid_wall (20  4 60) simpleGrading (1 1 1)
    hex (34 35 47 46  82  83  95  94) solid_wall ( 4  4 60) simpleGrading (1 1 1)
);

edges ();

boundary
(
    // -------------------------------------------------------
    // Combined inlet/outlet: all 33 blocks at x=0 and x=0.1.
    // splitMeshRegions auto-splits into fluid_he (5 channel
    // faces) and solid_wall (28 solid faces) sub-patches.
    // -------------------------------------------------------
    inlet
    {
        type patch;
        faces
        (
            // iz=0 bottom solid (11 faces)
            ( 0 12 13  1)  ( 1 13 14  2)  ( 2 14 15  3)  ( 3 15 16  4)
            ( 4 16 17  5)  ( 5 17 18  6)  ( 6 18 19  7)  ( 7 19 20  8)
            ( 8 20 21  9)  ( 9 21 22 10)  (10 22 23 11)
            // iz=1 channel layer (5 fluid + 6 solid walls = 11 faces)
            (12 24 25 13)  (13 25 26 14)  (14 26 27 15)  (15 27 28 16)
            (16 28 29 17)  (17 29 30 18)  (18 30 31 19)  (19 31 32 20)
            (20 32 33 21)  (21 33 34 22)  (22 34 35 23)
            // iz=2 top solid (11 faces)
            (24 36 37 25)  (25 37 38 26)  (26 38 39 27)  (27 39 40 28)
            (28 40 41 29)  (29 41 42 30)  (30 42 43 31)  (31 43 44 32)
            (32 44 45 33)  (33 45 46 34)  (34 46 47 35)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            // iz=0
            (48 49 61 60)  (49 50 62 61)  (50 51 63 62)  (51 52 64 63)
            (52 53 65 64)  (53 54 66 65)  (54 55 67 66)  (55 56 68 67)
            (56 57 69 68)  (57 58 70 69)  (58 59 71 70)
            // iz=1
            (60 61 73 72)  (61 62 74 73)  (62 63 75 74)  (63 64 76 75)
            (64 65 77 76)  (65 66 78 77)  (66 67 79 78)  (67 68 80 79)
            (68 69 81 80)  (69 70 82 81)  (70 71 83 82)
            // iz=2
            (72 73 85 84)  (73 74 86 85)  (74 75 87 86)  (75 76 88 87)
            (76 77 89 88)  (77 78 90 89)  (78 79 91 90)  (79 80 92 91)
            (80 81 93 92)  (81 82 94 93)  (82 83 95 94)
        );
    }

    // -------------------------------------------------------
    // chipFace: z=0  qubit chip at 10 mK
    // 11 faces — all solid_wall after splitting
    // -------------------------------------------------------
    chipFace
    {
        type wall;
        faces
        (
            ( 0  1 49 48)  ( 1  2 50 49)  ( 2  3 51 50)  ( 3  4 52 51)
            ( 4  5 53 52)  ( 5  6 54 53)  ( 6  7 55 54)  ( 7  8 56 55)
            ( 8  9 57 56)  ( 9 10 58 57)  (10 11 59 58)
        );
    }

    // -------------------------------------------------------
    // hotPlate: z=2mm  MXC environment at 100 mK
    // 11 faces — all solid_wall after splitting
    // -------------------------------------------------------
    hotPlate
    {
        type wall;
        faces
        (
            (36 84 85 37)  (37 85 86 38)  (38 86 87 39)  (39 87 88 40)
            (40 88 89 41)  (41 89 90 42)  (42 90 91 43)  (43 91 92 44)
            (44 92 93 45)  (45 93 94 46)  (46 94 95 47)
        );
    }

    // -------------------------------------------------------
    // outerY0: y=0 side face  MXC environment at 100 mK
    // 3 faces (iz=0,1,2) — all solid_wall after splitting
    // -------------------------------------------------------
    outerY0
    {
        type wall;
        faces
        (
            ( 0 48 60 12)
            (12 60 72 24)
            (24 72 84 36)
        );
    }

    // -------------------------------------------------------
    // outerY3: y=8mm side face  MXC environment at 100 mK
    // -------------------------------------------------------
    outerY3
    {
        type wall;
        faces
        (
            (11 23 71 59)
            (23 35 83 71)
            (35 47 95 83)
        );
    }
);

mergePatchPairs ();
