3-Sinter_vs_Microchannel_Comparison/1uW_load_envelope/Ag_1p0_s12p5/0/domain4/p_rgh
FoamFile
{
    version 2.0; format ascii;
    class volScalarField; location "0/domain4"; object p_rgh;
}
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 0;
boundaryField
{
    inlet { type zeroGradient; }
    outlet { type fixedValue; value uniform 0; }
    domain4_to_solid_wall { type fixedFluxPressure; value uniform 0; }
}
